docs/annotation.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-08 Fri 10:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Managing Genomic Annotations</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Nicholas Knoblauch">
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" integrity="sha384-Gn5384xqQ1aoWXA+058RXPxPg6fy4IWvTNh0E263XmFcJlSAwiGgFAW/dAiS6JXm" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Managing Genomic Annotations</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org83bc4a0">Downloading files</a>
<ul>
<li><a href="#org0e0857e">Roadmap epigenomic data</a></li>
</ul>
</li>
<li><a href="#orgcfa4f20">Annotation Merging</a>
<ul>
<li><a href="#org49c4d1a">down+up-&gt;diff</a></li>
<li><a href="#orgb3a5fa0">HiC combinations</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org83bc4a0" class="outline-2">
<h2 id="org83bc4a0">Downloading files</h2>
<div class="outline-text-2" id="text-org83bc4a0">
<p>
The first step is to download some LD score regression stuff from the web. In particular we want a gzipped tarball of the hapmap 3 SNPs.
</p>

<p>
Next we'll unzip the files and put them somewhere on disk.
</p>

<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">unzip_annot</span>:
    <span style="color: #99D6FF;">input</span>:
        config_d[<span style="color: #FFABAB;">'BED'</span>] + <span style="color: #FFABAB;">"{anno}.bed.bz2"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">'BED'</span>] + <span style="color: #FFABAB;">"{anno}.bed"</span>)
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"bunzip2 -cd {input} &gt; {output}"</span>



<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">gunzip_hm3</span>:
    <span style="color: #99D6FF;">input</span>:
        rules.get_hm3_snplist.<span style="color: #B46DCC;">output</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">dld</span>=config_d[<span style="color: #FFABAB;">'1KG'</span>]
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #B46DCC;">expand</span>(config_d[<span style="color: #FFABAB;">'1KG'</span>]+<span style="color: #FFABAB;">"hapmap3_snps/"</span>+<span style="color: #FFABAB;">"hm.{chrom}.snp"</span>,chrom=<span style="color: #B46DCC;">range</span>(1,23))
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"tar -C {params.dld} -xvzf {input}"</span>

</pre>
</div>
</div>


<div id="outline-container-org0e0857e" class="outline-3">
<h3 id="org0e0857e">Roadmap epigenomic data</h3>
<div class="outline-text-3" id="text-org0e0857e">
<p>
Below is a snakemake pattern for downloading roadmap data by tissue type.
</p>

<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_narrowpeak_aorta</span>:
    <span style="color: #99D6FF;">output</span>:
        config_d[<span style="color: #FFABAB;">"BED"</span>]+<span style="color: #FFABAB;">"chip-seq-reproducible-aorta-{mark}.bed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">mark</span>=<span style="color: #FFABAB;">"{mark}"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"curl https://egg2.wustl.edu/roadmap/data/byFileType/peaks/consolidated/narrowPeak/E065-{params.mark}.narrowPeak.gz | gunzip -c | bzip2 -c &gt; {output}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_narrowpeak_finte</span>:
    <span style="color: #99D6FF;">output</span>:
        config_d[<span style="color: #FFABAB;">"BED"</span>]+<span style="color: #FFABAB;">"chip-seq-reproducible-finte-{mark}.bed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">mark</span>=<span style="color: #FFABAB;">"{mark}"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"curl https://egg2.wustl.edu/roadmap/data/byFileType/peaks/consolidated/narrowPeak/E085-{params.mark}.narrowPeak.gz | gunzip -c | bzip2 -c &gt; {output}"</span>


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_narrowpeak_liver</span>:
    <span style="color: #99D6FF;">output</span>:
        config_d[<span style="color: #FFABAB;">"BED"</span>]+<span style="color: #FFABAB;">"chip-seq-reproducible-liver-{mark}.bed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">mark</span>=<span style="color: #FFABAB;">"{mark}"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"curl https://egg2.wustl.edu/roadmap/data/byFileType/peaks/consolidated/narrowPeak/E066-{params.mark}.narrowPeak.gz | gunzip -c | bzip2 -c &gt; {output}"</span>


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_broadpeak_aorta</span>:
    <span style="color: #99D6FF;">output</span>:
        config_d[<span style="color: #FFABAB;">"BED"</span>]+<span style="color: #FFABAB;">"chip-seq-reproducible-aortabroad-{mark}.bed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">mark</span>=<span style="color: #FFABAB;">"{mark}"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"curl https://egg2.wustl.edu/roadmap/data/byFileType/peaks/consolidated/broadPeak/E065-{params.mark}.broadPeak.gz | gunzip -c | bzip2 -c &gt; {output}"</span>


</pre>
</div>

<p>
And another pattern for downloading spidex and cadd annotations
</p>
<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_cadd</span>:
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">"DL"</span>]+<span style="color: #FFABAB;">"whole_genome_SNVs_inclAnno.tsv.gz"</span>)
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"wget https://krishna.gs.washington.edu/download/CADD/v1.4/GRCh37/whole_genome_SNVs_inclAnno.tsv.gz -O {output}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">get_spidex</span>:
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #B46DCC;">temp</span>(config_d[<span style="color: #FFABAB;">"DL"</span>]+<span style="color: #FFABAB;">"hg19_spidex.zip"</span>)
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"wget http://www.openbioinformatics.org/annovar/download/IlvUMvrpPT/hg19_spidex.zip -O {output}"</span>

</pre>
</div>
</div>



<div id="outline-container-orgcb55e3f" class="outline-4">
<h4 id="orgcb55e3f">Download TCM files from the nobrega lab</h4>
<div class="outline-text-4" id="text-orgcb55e3f">
<p>
the file mod<sub>tmp.netrc</sub> is not included in this git repository. Contact the nobrega lab for access
</p>

<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">dl_pltcm_atac</span>:
    <span style="color: #FFABAB;">"""Download preterm TCM ATAC-seq data"""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">bed_file</span> = config_d[<span style="color: #FFABAB;">'BED'</span>] + <span style="color: #FFABAB;">"atac-seq-reproducible-pl_tcm-ATAC.bed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">DLD</span>=config_d[<span style="color: #FFABAB;">'BED'</span>],
        <span style="color: #FF9326;">file_pref</span>=<span style="color: #FFABAB;">"peaks-PL-TCM-reproducible"</span>,
        <span style="color: #FF9326;">netrc</span> = <span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/workflow/mod_tmp.netrc"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"curl -s --netrc-file {params.netrc}  --digest https://mnlab.uchicago.edu/mod/tmp/peaks-tcm/{params.file_pref}.bed | bzip2 -c &gt; {output.bed_file}"</span>


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">dl_pldec_atac</span>:
    <span style="color: #FFABAB;">"""Download preterm dec ATAC-seq data"""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">bed_file</span> = config_d[<span style="color: #FFABAB;">'BED'</span>] + <span style="color: #FFABAB;">"atac-seq-reproducible-pl_dec-ATAC.bed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">DLD</span>=config_d[<span style="color: #FFABAB;">'BED'</span>],
        <span style="color: #FF9326;">file_pref</span>=<span style="color: #FFABAB;">"peaks-PL-dec-reproducible"</span>,
        <span style="color: #FF9326;">netrc</span> = <span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/workflow/mod_tmp.netrc"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"curl -s --netrc-file {params.netrc}  --digest https://mnlab.uchicago.edu/mod/tmp/peaks-tcm/{params.file_pref}.bed | bzip2 -c &gt; {output.bed_file}"</span>

<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">dl_tltcm_atac</span>:
    <span style="color: #FFABAB;">"""Download term TCM ATAC-seq data"""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">bed_file</span> = config_d[<span style="color: #FFABAB;">'BED'</span>] + <span style="color: #FFABAB;">"atac-seq-reproducible-tl_tcm-ATAC.bed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">DLD</span>=config_d[<span style="color: #FFABAB;">'BED'</span>],
        <span style="color: #FF9326;">file_pref</span>=<span style="color: #FFABAB;">"peaks-TL-TCM-reproducible"</span>,
        <span style="color: #FF9326;">netrc</span> = <span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/workflow/mod_tmp.netrc"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"curl -s --netrc-file {params.netrc}  --digest https://mnlab.uchicago.edu/mod/tmp/peaks-tcm/{params.file_pref}.bed | bzip2 -c &gt; {output.bed_file}"</span>


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">dl_tldec_atac</span>:
    <span style="color: #FFABAB;">"""Download term decidualized ATAC-seq data"""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">bed_file</span> = config_d[<span style="color: #FFABAB;">'BED'</span>] + <span style="color: #FFABAB;">"atac-seq-reproducible-tl_dec-ATAC.bed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">DLD</span>=config_d[<span style="color: #FFABAB;">'BED'</span>],
        <span style="color: #FF9326;">file_pref</span>=<span style="color: #FFABAB;">"peaks-TL-dec-reproducible"</span>,
        <span style="color: #FF9326;">netrc</span> = <span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/workflow/mod_tmp.netrc"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"curl -s --netrc-file {params.netrc}  --digest https://mnlab.uchicago.edu/mod/tmp/peaks-tcm/{params.file_pref}.bed | bzip2 -c &gt; {output.bed_file}"</span>


<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">dl_hic_atac</span>:
    <span style="color: #FFABAB;">"""Download term decidualized ATAC-seq data"""</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">bed_file</span> = config_d[<span style="color: #FFABAB;">'BED'</span>] + <span style="color: #FFABAB;">"DT1_dTL4_D_48h.ibed.bz2"</span>
    <span style="color: #99D6FF;">params</span>:
        <span style="color: #FF9326;">DLD</span>=config_d[<span style="color: #FFABAB;">'BED'</span>],
        <span style="color: #FF9326;">file_pref</span>=<span style="color: #FFABAB;">"peaks-TL-dec-reproducible"</span>,
        <span style="color: #FF9326;">netrc</span> = <span style="color: #FFABAB;">"/home/nwknoblauch/Dropbox/Repos/ptb_workflowr/workflow/mod_tmp.netrc"</span>
    <span style="color: #99D6FF;">shell</span>:
        <span style="color: #FFABAB;">"curl -s --netrc-file {params.netrc}  --digest https://mnlab.uchicago.edu/mod/download/hi-c/DT1_dTL4_D_48h.ibed.bz2 &gt; {output.bed_file}"</span>



</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcfa4f20" class="outline-2">
<h2 id="orgcfa4f20">Annotation Merging</h2>
<div class="outline-text-2" id="text-orgcfa4f20">
<p>
Some annotations (e.g the differential annotations) were merged at various points, here's how I did that. 
</p>
</div>

<div id="outline-container-org49c4d1a" class="outline-3">
<h3 id="org49c4d1a">down+up-&gt;diff</h3>
<div class="outline-text-3" id="text-org49c4d1a">
<p>
We're going to merge the <code>dec_down</code> and <code>dec_up</code> annotations to create a <code>dec_diff</code> annotation
</p>

<p>
<code>merge_diff.R</code> belongs to the rule <code>merge_down_up</code>.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(readr)
<span style="color: #C04040;">library</span>(ldmap)
<span style="color: #C04040;">library</span>(EigenH5)

input_down <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"input_down"</span>]]
input_up <span style="color: #C04040;">&lt;-</span> snakemake@input[[<span style="color: #FFABAB;">"input_up"</span>]]
outputf <span style="color: #C04040;">&lt;-</span> snakemake@output[[<span style="color: #FFABAB;">"bedf"</span>]]

dcols <span style="color: #C04040;">&lt;-</span> cols(
    chrom = col_factor(paste0(<span style="color: #FFABAB;">"chr"</span>, c(as.character(1:22), <span style="color: #FFABAB;">"X"</span>))),
    start = col_integer(),
    end = col_integer()
)

diff_df <span style="color: #C04040;">&lt;-</span> vroom::vroom(c(input_up, input_down),
    delim = <span style="color: #FFABAB;">"   "</span>,
    col_names = c(<span style="color: #FFABAB;">"chrom"</span>, <span style="color: #FFABAB;">"start"</span>, <span style="color: #FFABAB;">"end"</span>),
    col_types = dcols
)
new_ldmap_region(
    diff_df$chrom,
    diff_df$start,
    diff_df$end
) <span style="color: #C04040;">%&gt;%</span>
    split_ldmap_region_overlap() <span style="color: #C04040;">%&gt;%</span>
    ldmap_region_2_data_frame() <span style="color: #C04040;">%&gt;%</span>
    vroom::vroom_write(outputf, delim = <span style="color: #FFABAB;">"       "</span>, col_names = <span style="color: #99D6FF;">FALSE</span>)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">merge_down_up</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">input_down</span>=config_d[<span style="color: #FFABAB;">'BED'</span>]+<span style="color: #FFABAB;">"{chip_atac}-seq-dec_down-{mark}.bed"</span>,
        <span style="color: #FF9326;">input_up</span>=config_d[<span style="color: #FFABAB;">'BED'</span>]+<span style="color: #FFABAB;">"{chip_atac}-seq-dec_up-{mark}.bed"</span>
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">bedf</span>=config_d[<span style="color: #FFABAB;">'BED'</span>]+<span style="color: #FFABAB;">"{chip_atac}-seq-dec_diff-{mark}.bed"</span>
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'r'</span>]
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/merge_diff.R"</span>

</pre>
</div>
</div>
</div>


<div id="outline-container-orgb3a5fa0" class="outline-3">
<h3 id="orgb3a5fa0">HiC combinations</h3>
<div class="outline-text-3" id="text-orgb3a5fa0">
<p>
I created three annotations out of the HiC data. One contains baits only, one targets only and one target|bait
</p>

<p>
<code>merge_hic.R</code> belongs to the rule <code>merge_split_hic</code>
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #C04040;">library</span>(dplyr)
<span style="color: #C04040;">library</span>(forcats)
<span style="color: #C04040;">library</span>(purrr)
<span style="color: #C04040;">library</span>(readr)
<span style="color: #C04040;">library</span>(ldmap)
<span style="color: #C04040;">library</span>(EigenH5)

cold <span style="color: #C04040;">&lt;-</span> cols(
    bait_chr = col_factor(paste0(<span style="color: #FFABAB;">"chr"</span>, c(as.character(1:22), c(<span style="color: #FFABAB;">"X"</span>, <span style="color: #FFABAB;">"Y"</span>)))),
    bait_start = col_double(),
    bait_end = col_double(),
    bait_name = col_character(),
    otherEnd_chr = col_factor(paste0(<span style="color: #FFABAB;">"chr"</span>, c(as.character(1:22), c(<span style="color: #FFABAB;">"X"</span>, <span style="color: #FFABAB;">"Y"</span>)))),
    otherEnd_start = col_double(),
    otherEnd_end = col_double(),
    otherEnd_name = col_character(),
    N_reads = col_double(),
    score = col_double()
)
input_hic <span style="color: #C04040;">&lt;-</span> read_tsv(snakemake@input[[<span style="color: #FFABAB;">"inputf"</span>]], col_names = names(cold$cols), col_types = cold, skip = 1L) <span style="color: #C04040;">%&gt;%</span>
    filter(bait_chr != <span style="color: #FFABAB;">"chrY"</span>, otherEnd_chr != <span style="color: #FFABAB;">"chrY"</span>) <span style="color: #C04040;">%&gt;%</span>
    mutate(bait_chr = fct_drop(bait_chr), otherEnd_chr = fct_drop(otherEnd_chr))

baitf <span style="color: #C04040;">&lt;-</span> snakemake@output[[<span style="color: #FFABAB;">"bait"</span>]]
targetf <span style="color: #C04040;">&lt;-</span> snakemake@output[[<span style="color: #FFABAB;">"target"</span>]]
bothf <span style="color: #C04040;">&lt;-</span> snakemake@output[[<span style="color: #FFABAB;">"both"</span>]]

bait_ld <span style="color: #C04040;">&lt;-</span> new_ldmap_region(
    input_hic$bait_chr,
    input_hic$bait_start,
    input_hic$bait_end
)

target_ld <span style="color: #C04040;">&lt;-</span> new_ldmap_region(
    input_hic$otherEnd_chr,
    input_hic$otherEnd_start,
    input_hic$otherEnd_end
)

both_ld <span style="color: #C04040;">&lt;-</span> merge_ldmap_regions(bait_ld, target_ld)

ldmap_region_2_data_frame(bait_ld) <span style="color: #C04040;">%&gt;%</span>
    write_tsv(baitf, col_names = <span style="color: #99D6FF;">FALSE</span>)
ldmap_region_2_data_frame(target_ld) <span style="color: #C04040;">%&gt;%</span>
    write_tsv(targetf, col_names = <span style="color: #99D6FF;">FALSE</span>)
ldmap_region_2_data_frame(both_ld) <span style="color: #C04040;">%&gt;%</span>
    write_tsv(bothf, col_names = <span style="color: #99D6FF;">FALSE</span>)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-snakemake">
<span style="color: #C8FF03;">rule</span> <span style="color: #FFE203;">merge_split_hic</span>:
    <span style="color: #99D6FF;">input</span>:
        <span style="color: #FF9326;">inputf</span>=config_d[<span style="color: #FFABAB;">'BED'</span>]+<span style="color: #FFABAB;">"DT1_dTL4_D_48h.ibed.bz2"</span>,
    <span style="color: #99D6FF;">output</span>:
        <span style="color: #FF9326;">bait</span>=config_d[<span style="color: #FFABAB;">'BED'</span>]+<span style="color: #FFABAB;">"hicd-seq-bait-dec-HIC.bed"</span>,
        <span style="color: #FF9326;">target</span>=config_d[<span style="color: #FFABAB;">'BED'</span>]+<span style="color: #FFABAB;">"hicd-seq-target-dec-HIC.bed"</span>,
        <span style="color: #FF9326;">both</span>=config_d[<span style="color: #FFABAB;">'BED'</span>]+<span style="color: #FFABAB;">"hicd-seq-both-dec-HIC.bed"</span>
    <span style="color: #99D6FF;">conda</span>:
        config_e[<span style="color: #FFABAB;">'r'</span>]
    <span style="color: #99D6FF;">script</span>:
        <span style="color: #FFABAB;">"../scripts/merge_hic.R"</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nicholas Knoblauch</p>
<p class="date">Created: 2020-05-08 Fri 10:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
